Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""

x_num = int(input('Введите трехзначное число: '))
x_sum = 0
while x_num / 10 > 0:
    x_sum = x_sum + x_num % 10
    x_num //= 10
print(f'Сумма цифр трехзначного числа равна: {x_sum}')


Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
Сколько журавликов сделал каждый ребенок, если известно,
что Петя и Сережа сделали одинаковое количество журавликов,
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10
"""

a = int(input('Сколько журавликов сделали Петя, Катя и Сережа вместе:'))
k = int((a / 3) * 2)
p = int((k / 2) / 2)
s = int(p)
print(f'Петя: {p}, Катя: {k}, Сережа: {s}')


Задача 6: Вы пользуетесь общественным транспортом?
Вероятно, вы расплачивались за проезд и получали билет с номером.
Счастливым билетом называют такой билет с шестизначным номером,
где сумма первых трех цифр равна сумме последних трех.
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
Вам требуется написать программу, которая проверяет счастливость билета.
*Пример:*
385916 -> yes
123456 -> no
"""

while True:
    x_number = input('Введите шестизначный номер Вашего билета: ')
    if x_number.isdigit() and len(x_number) == 6:
        if sum(map(int, x_number[:3])) == sum(map(int, x_number[3:])):
            print('Ура, Ваш билет счастливый!')
        else:
            print('Увы, Ваш билет не счастливый(')
        break
    else:
        print('Введен некорректный номер билета, попробуйте еще раз)')


Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
если разрешается сделать один разлом по прямой между дольками
(то есть разломить шоколадку на два прямоугольника).
*Пример:*
3 2 4 -> yes
3 2 1 -> no
"""

x_n = int(input("Введите один размер шоколадки в дольках: "))
x_m = int(input("Введите другой размер шоколадки в дольках: "))
x_k = int(input("Введите количество долек, которое хотите отломить: "))

if x_k < x_m * x_n and (x_k % x_m == 0 or x_k % x_n == 0):
    print('Да')
else:
    print('Нет')
    